In [1]:
import pandas as pd
import numpy as np

### Transactions

In [2]:
df = pd.read_excel('Dataset/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=1, header = 0)
df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,41245.0
1,2,3,3120,2017-05-21,1.0,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701.0
2,3,37,402,2017-10-16,0.0,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,36361.0
3,4,88,3135,2017-08-31,0.0,Approved,Norco Bicycles,Standard,medium,medium,1198.46,381.10,36145.0
4,5,78,787,2017-10-01,1.0,Approved,Giant Bicycles,Standard,medium,large,1765.30,709.48,42226.0

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [4]:
df.isna().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [5]:
df['online_order'] = df['online_order'].fillna(method = 'bfill')

In [6]:
df[['brand', 'product_line', 'product_class', 'product_size']] = df[['brand', 'product_line', 'product_class', 'product_size']].fillna(method = 'ffill')

In [7]:
df['standard_cost'] = df['standard_cost'].fillna(df['standard_cost'].mean())

In [8]:
df['product_first_sold_date'] = df['product_first_sold_date'].fillna(df['product_first_sold_date'].mean())

In [9]:
df.isna().any().sum()

0

In [10]:
df.to_csv('Dataset/CleanedData/Transactions.csv', index = False)

### NewCustomerList

In [11]:
df2 = pd.read_excel('Dataset/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=2, header = 0)
df2.head()

C:\Users\Abdelrhman Saeed\AppData\Local\Temp\ipykernel_7112\1374657617.py:1: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  df2 = pd.read_excel('Dataset/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=2, header = 0)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,0.66,0.825,1.03125,0.876563,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.83,0.830,1.03750,0.881875,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,0.85,0.850,0.85000,0.850000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.46,0.575,0.57500,0.575000,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.70,0.700,0.87500,0.875000,4,4,1.703125

In [12]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [13]:
df2.isna().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [14]:
del df2['Unnamed: 16']
del df2['Unnamed: 17']
del df2['Unnamed: 18']
del df2['Unnamed: 19']
del df2['Unnamed: 20']

In [15]:
df2['last_name'] = df2.groupby('first_name').last_name.bfill().ffill()

In [16]:
df2['DOB'] = df2['DOB'].dt.date

In [17]:
df2['DOB'].fillna(lambda x: np.random.choice(df2['DOB']), inplace=True)

In [18]:
df2['job_title']= df2['job_title'].fillna(method='bfill')

In [19]:
df2['job_industry_category']= df2['job_industry_category'].fillna(method='ffill')

In [20]:
df2.columns = map(str.lower, df2.columns)
df2.columns = map(str.strip, df2.columns)

In [21]:
df2.isna().any().sum()

0

In [22]:
df2.to_csv('Dataset/CleanedData/NewCustomerList.csv', index = False)

### CustomerDemographic

In [23]:
df3 = pd.read_excel('Dataset/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=3, header = 0)
df3.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [24]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 12 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3999 non-null   int64
 1   first_name                           3999 non-null   object
 2   last_name                            3874 non-null   object
 3   gender                               3999 non-null   object
 4   past_3_years_bike_related_purchases  3999 non-null   int64
 5   DOB                                  3912 non-null   datetime64[ns]
 6   job_title                            3493 non-null   object
 7   job_industry_category                3343 non-null   object
 8   wealth_segment                       3999 non-null   object
 9   deceased_indicator                   3999 non-null   object
 10  owns_car                             3999 non-null   object
 11  tenure                               3912 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(8)
memory usage: 375.0+ KB

In [25]:
df3.isna().any().sum()

5

In [26]:
df3['gender'] = df3['gender'].astype('category')

In [27]:
df3['gender'].replace({'M': "Male", 'F': "Female", 'Femal': "Female"}, inplace = True)

In [28]:
df3['job_title']= df3['job_title'].fillna(method='bfill')

In [29]:
df3['job_industry_category']= df3['job_industry_category'].fillna(method='ffill')

In [30]:
df3['DOB'] = df3['DOB'].dt.date

In [31]:
df3['deceased_indicator'].replace({'N': False, 'Y': True}, inplace = True)

In [32]:
df3['owns_car'].replace({'No': False, 'Yes': True}, inplace = True)

In [33]:
val = np.nanmedian(df3['tenure'])
df3['tenure'].fillna(value = val, inplace = True)

In [34]:
df3.columns = map(str.lower, df3.columns)
df3.columns = map(str.strip, df3.columns)

In [35]:
df3.isna().any().sum()

2

In [36]:
df3.to_csv('Dataset/CleanedData/CustomerDemographic.csv', index = False)

### CustomerAddress

In [37]:
df4 = pd.read_excel('Dataset/KPMG_VI_New_raw_data_update_final.xlsx', sheet_name=4, header = 0)
df4.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [38]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [39]:
df4.isna().sum()

customer_id           0
address               0
postcode              0
state                 0
country               0
property_valuation    0
dtype: int64

In [40]:
df4['state'].replace({'New South Wales': 'NSW', 'Victoria': 'VIC'}, inplace=True)

In [41]:
df4.columns = map(str.lower, df4.columns)
df4.columns = map(str.strip, df4.columns)

In [42]:
df4.to_csv('Dataset/CleanedData/CustomerAddress.csv', index = False)